spec/cassettes/User/_start_recurring_payments/makes_a_payment_for_the_recurring_amount_of_the_users_s_plan.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:05 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMa53b28a2594c11e48a6802a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBQ5WX1IBCwlXU1QDBgBWUR0WAVBQT0ISBlpVXggHBlJUWFYDUwJSVBQbQQACVEBVOQ==
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-21T18:04:05.615964Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-21T18:04:05.615968Z",
              "href": "/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA52cBOvQLvwgcSJGmlT8kSc"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:08 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:06 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMa5dfbff2594c11e4b1cd06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '498'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-21T18:04:05.615964Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-21T18:04:05.615968Z",
              "href": "/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA52cBOvQLvwgcSJGmlT8kSc"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:08 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc/verifications
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:18 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMa63cf35c594c11e4bdff02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA52cBOvQLvwgcSJGmlT8kSc"
              },
              "href": "/verifications/BZ5fwfmDFEwOEVmdD3MQ3PFz",
              "created_at": "2014-10-21T18:04:17.456013Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-21T18:04:17.781512Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ5fwfmDFEwOEVmdD3MQ3PFz"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:21 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMad79eada594c11e4b7f006429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '524'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ5fwfmDFEwOEVmdD3MQ3PFz"
              },
              "can_credit": true,
              "created_at": "2014-10-21T18:04:05.615964Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-21T18:04:05.615968Z",
              "href": "/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA52cBOvQLvwgcSJGmlT8kSc"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:21 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ5fwfmDFEwOEVmdD3MQ3PFz
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMadc0e7e6594c11e4b7f006429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA52cBOvQLvwgcSJGmlT8kSc"
              },
              "href": "/verifications/BZ5fwfmDFEwOEVmdD3MQ3PFz",
              "created_at": "2014-10-21T18:04:17.456013Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-21T18:04:17.781512Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ5fwfmDFEwOEVmdD3MQ3PFz"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:22 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ5fwfmDFEwOEVmdD3MQ3PFz
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA52cBOvQLvwgcSJGmlT8kSc"},"created_at":"2014-10-21T18:04:17.456013Z","attempts_remaining":3,"updated_at":"2014-10-21T18:04:17.781512Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ5fwfmDFEwOEVmdD3MQ3PFz","amount_1":"1","amount_2":"1"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:20 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMae0afee4594c11e4a0ee06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA52cBOvQLvwgcSJGmlT8kSc"
              },
              "href": "/verifications/BZ5fwfmDFEwOEVmdD3MQ3PFz",
              "created_at": "2014-10-21T18:04:17.456013Z",
              "attempts_remaining": 2,
              "updated_at": "2014-10-21T18:04:20.072721Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ5fwfmDFEwOEVmdD3MQ3PFz"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:22 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:21 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMaeed6be4594c11e4a09f02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '525'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ5fwfmDFEwOEVmdD3MQ3PFz"
              },
              "can_credit": true,
              "created_at": "2014-10-21T18:04:05.615964Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-21T18:04:20.071766Z",
              "href": "/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA52cBOvQLvwgcSJGmlT8kSc"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:24 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA52cBOvQLvwgcSJGmlT8kSc/debits
    body:
      encoding: UTF-8
      string: '{"amount":60000,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 18:04:22 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMaf45976a594c11e4bdff02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.30
      Content-Length:
      - '1063'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "BA52cBOvQLvwgcSJGmlT8kSc",
                "card_hold": null,
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-10-21T18:04:22.310725Z",
              "created_at": "2014-10-21T18:04:22.122073Z",
              "transaction_number": "WNTY-7NM-AYA0",
              "failure_reason": null,
              "currency": "USD",
              "amount": 60000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD5kLzNlk61daowvxCD1iEGk",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD5kLzNlk61daowvxCD1iEGk"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 18:04:25 GMT
recorded_with: VCR 2.9.3
